import fs, { promises } from 'fs'
import fetch from 'node-fetch'
let handler = async (m, { conn, usedPrefix, command }) => {
try {
let d = new Date(new Date + 3600000)
let locale = 'es'
let week = d.toLocaleDateString(locale, { weekday: 'long' })
let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
let _uptime = process.uptime() * 1000
let uptime = clockString(_uptime)
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(850)   
let taguser = conn.getName(m.sender)
let user = global.db.data.users[m.sender]
let fkontak = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }
let menu = `• مرحبا ياروحي ⤌⤈       
↝ *${taguser}* ↜     
• انا بوت واتس اسمي ⤌⤈
↝ *بوت التوينز الكاريزما*
• اعمل في الخاص وجروبات •
• وظيفتي حماية جروبك •
• تفضل اوامر البوت •
𓍹——————————𓍻
↝اليك قائمة باوامر الاعضاء↜ 
𓍹——————————𓍻
❰ .ايدي ❱
♚ لمعرفة معلوماتك 
ꔹ━━━━━ꔹ
❰ .السورس ❱
♚ لعرض روابط وصنع بوت مشابه
ꔹ━━━━━ꔹ
❰ .الدعم ❱
♚ لعرض رابط الدعم 
ꔹ━━━━━ꔹ
❰ .المطور ❱
♚ لمعرفه مطور البوت 
ꔹ━━━━━ꔹ
❰ .انطق ❱
♚ البوت ينطق المكتوب
ꔹ━━━━━ꔹ
❰ .باركود ❱
♚ يحول اي شي ل باركود
ꔹ━━━━━ꔹ
❰ .تخمين ❱
♚ تخمين ارقام مثل رقمك
ꔹ━━━━━ꔹ
❰ .التوقيت ❱
♚ يجيبلك توقيت دول اخري
ꔹ━━━━━ꔹ
❰ .تحدث ❱
♚ التحدث مع الذكاء الاصطناعي
ꔹ━━━━━ꔹ
❰ .بوت ❱
♚ تحدث مع البوت
ꔹ━━━━━ꔹ
❰ .تطقيم ❱
♚ جلب تطقيمات انمي

𓍹——————————𓍻
↝اليك قائمة باوامر المطور↜
𓍹——————————𓍻
❰ .بريم ❱
♚ جعل شخص مميز بالبوت
ꔹ━━━━━ꔹ
❰ .بريم-خفض ❱
♚ خفض شخص من مميز لـ عادي
ꔹ━━━━━ꔹ
❰ .المميزين ❱
♚ يجيبلك الاعضاء البريميوم
ꔹ━━━━━ꔹ
❰ .بان ❱
♚ حظر اي شخص من استخدام البوت 
ꔹ━━━━━ꔹ
❰ .رفع-البان ❱
♚ رفع الحظر عن شخص من استخدام البوت
ꔹ━━━━━ꔹ
❰ .اخرج ❱
♚ خروج البوت من الجروب 
ꔹ━━━━━ꔹ
❰ .انضم ❱
♚ ينضم البوت لجروب عبر الرابط
ꔹ━━━━━ꔹ
❰ .بلوك ❱
♚ عمل بلوك لشخص من البوت 
ꔹ━━━━━ꔹ
❰ .رفع-البلوك ❱
♚ الغاء البلوك عن الشخص 
ꔹ━━━━━ꔹ
❰ .البلوكات ❱
♚ الاشخاص ال البوت عاملهم بلوك
ꔹ━━━━━ꔹ
❰ .حظر ❱
♚ حظر الشات للبوت
ꔹ━━━━━ꔹ
❰ .الغاء-حظر ❱
♚ الغاء حظر الشات للبوت
ꔹ━━━━━ꔹ
❰ .ابلاغ ❱
♚ ابلاغ المطور عن ايرور
ꔹ━━━━━ꔹ
❰ .بنج ❱
♚ يجيبلك معلومات عن خادم البوت ...الخ
ꔹ━━━━━ꔹ
❰ .تسريع ❱
♚ تسريع البوت
ꔹ━━━━━ꔹ
❰ .تحديث ❱
♚ تحديث البوت
ꔹ━━━━━ꔹ
❰ .السرعه ❱
♚ يجيبلك معلومات عن سرعة البوت...الخ
ꔹ━━━━━ꔹ
❰ .ستوري ❱
♚ يرفع استوري انت تحددها
ꔹ━━━━━ꔹ
❰ .اذاعه ❱
♚ عمل اذاعه في البوت

𓍹——————————𓍻
↝اليك قائمة باوامر الجروب↜
𓍹——————————𓍻
❰ .منشن ❱
♚ منشن جماعي لكل الاعضاء
ꔹ━━━━━ꔹ
❰ .منشنلي ❱
♚ البوت يمنشن ليك
ꔹ━━━━━ꔹ
❰ .مخفي ❱
♚ منشن مخفي لكل الاعضاء 
ꔹ━━━━━ꔹ
❰ .الاصنام ❱
♚ يمنشن للناس ال مبتتفاعلش 
ꔹ━━━━━ꔹ
❰ .حذف ❱
♚ حذف رسالة البوت والاعضاء
ꔹ━━━━━ꔹ
❰ .لينك ❱
♚ يرسلك رابط الجروب 
ꔹ━━━━━ꔹ
❰ .رستر ❱
♚ رستارت لرابط الجروب 
ꔹ━━━━━ꔹ
❰ .رفع ❱
♚ رفع عضو لمشرف 
ꔹ━━━━━ꔹ
❰ .خفض ❱
♚ تنزيل عضو من المشرف 
ꔹ━━━━━ꔹ
❰ .تغيرالاسم ❱
♚ تغيير اسم الجروب 
ꔹ━━━━━ꔹ
❰ .تغيرالوصف ❱
♚ تغيير وصف الجروب 
ꔹ━━━━━ꔹ
❰ .تغيرالصوره ❱
♚ تغيير صورة الجروب 
ꔹ━━━━━ꔹ
❰ .جروب فتح ❱
♚ فتح الجروب
ꔹ━━━━━ꔹ
❰ .جروب غلق ❱
♚ اغلاق الجروب
ꔹ━━━━━ꔹ
❰ .طرد ❱
♚ طرد شخص من الجروب 
ꔹ━━━━━ꔹ
❰ .اعدادات ❱
♚ منع ارسال الروابط في الجروب 
ꔹ━━━━━ꔹ
❰ .انذار ❱
♚ جلب نسبه حب الشخص لك
ꔹ━━━━━ꔹ
❰ .الغاء-الانذار ❱
♚ الغاء الانذار من شخص
ꔹ━━━━━ꔹ
❰ .التحذيرات ❱
♚ يجيبلك الاشخاص ال معهم انذارات
ꔹ━━━━━ꔹ
❰ .فحص ❱
♚ البوت يفحص الجروب 
ꔹ━━━━━ꔹ
❰ .المشرفين ❱
♚ يجيبلك قائمة المشرفين

𓍹——————————𓍻
↝اليك قائمة باوامر التنزيل↜
𓍹——————————𓍻
❰ .يوتيوب ❱
♚ البحث عن مقطع أغنية 
ꔹ━━━━━ꔹ
❰ .ملف-يوتيوب ❱
♚ تحميل فديو اليوتيوب في هيئة ملف 
ꔹ━━━━━ꔹ
❰ .فيديو ❱
♚ تحميل فيديوهات يوتيوب بالرابط
ꔹ━━━━━ꔹ
❰ .حزمه ❱
♚ تحميل حزمة ملصقات من ستيكر ميكر  
ꔹ━━━━━ꔹ
❰ .بينت ❱
♚ تحميل صورة من بينت ارست
ꔹ━━━━━ꔹ
❰ .تيك ❱
♚ تحميل فديوهات من التيك توك 
ꔹ━━━━━ꔹ
❰ .صوره ❱
♚ البحث عن صور عشوائية 
ꔹ━━━━━ꔹ
❰ .خلفية ❱
♚ تنزيل خلفيات

𓍹——————————𓍻
↝اليك قائمة باوامر التحويل↜
𓍹——————————𓍻
❰ .ملصق ❱
♚ تحويل الصور والفيديوهات لملصق
ꔹ━━━━━ꔹ
❰ .استك ❱
♚ يحول لك الكلام الي ملصق في شكل تعليق
ꔹ━━━━━ꔹ
❰ .تدوير ❱
♚ تحويل الصورة لاستيكر دائري
ꔹ━━━━━ꔹ
❰ .سرقه ❱
♚ تغير حقوق الاستيكر
ꔹ━━━━━ꔹ
❰ .لانمي ❱
♚ تحويل الصورة لانمي
ꔹ━━━━━ꔹ
❰ .لكرتون ❱
♚ تحويل الصورة لكرتون
ꔹ━━━━━ꔹ
❰ .لصورة ❱
♚ تحويل الاستيكر لصورة
ꔹ━━━━━ꔹ
❰ .لفيديو ❱
♚ تحويل الاستيكر المتحرك لفديو 
ꔹ━━━━━ꔹ
❰ .لصوت ❱
♚ تحويل الفديو لصوت
ꔹ━━━━━ꔹ
❰ .انطق ❱
♚ تحويل النص الي كلام 
ꔹ━━━━━ꔹ
❰ .تليجراف ❱
♚ رفع الصور لتليجراف
ꔹ━━━━━ꔹ
❰ .كلام مشفر ❱
♚ تحويل الكلام لشفرة مورس
ꔹ━━━━━ꔹ
❰ .فك التشفير ❱
♚ فك شفرة مورس
ꔹ━━━━━ꔹ
❰ .كود ❱
♚ تحويل اي شئ لباركود 
ꔹ━━━━━ꔹ
❰ .لوجو ❱
♚ تحويل النص للوغو
ꔹ━━━━━ꔹ
❰ .قص ❱
♚ قص وتصغير الروابط 
ꔹ━━━━━ꔹ
❰ .سلس ❱
♚ التعديل ع سلاسه الصوت
ꔹ━━━━━ꔹ
❰ .سنجاب ❱
♚ تغير الصوتيات لصوت السنجاب
ꔹ━━━━━ꔹ
❰ .منفوخ  ❱
♚ التعديل ع الصوتيات واضافه تاثيرات
 ꔹ━━━━━ꔹ
❰ .عميق  ❱
♚ تحويل الصوتيات الي صوت عميق
ꔹ━━━━━ꔹ
❰ .تحسين ❱
♚ تعديل وتحسين الصوتيات
ꔹ━━━━━ꔹ
❰ .بطئ ❱
♚ تقليل سرعة الصوتيات
ꔹ━━━━━ꔹ
❰ .سريع ❱
♚ زيادة سرعة الصوتيات
ꔹ━━━━━ꔹ
❰ .عكس ❱
♚ عكس المقاطع الصوتية
ꔹ━━━━━ꔹ
❰ .عميق2 ❱
♚ تقليل السرعه مع الغاء التشويش 
ꔹ━━━━━ꔹ
❰ .بسيط ❱
♚ تغير الصوت الى صوت بسيط
ꔹ━━━━━ꔹ
❰ .الي ❱
♚ تحويل الصوت الي صوت انسان الي

𓍹——————————𓍻
↝اليك قائمة باوامر الملصقات↜
𓍹——————————𓍻
❰ .ملصق-انمي ❱
♚ يجيبلك ملصقات انمي
ꔹ━━━━━ꔹ
❰ .ملصق-انمي2 ❱
♚ يجيبلك ملصقات انمي
ꔹ━━━━━ꔹ
❰ .اكل ❱
♚ ملصق انمي لشخص ياكل
ꔹ━━━━━ꔹ
❰ .تليجرام ❱
♚ تحميل حزمة الاستيكر من تليجرام
ꔹ━━━━━ꔹ
❰ .استك ❱
♚ تحويل اي كلام لملصق

𓍹——————————𓍻
↝اليك قائمة باوامر التسليه↜
𓍹——————————𓍻
❰ .نصائح ❱
♚ يجيبلك نصائح للحياة وغيرها
ꔹ━━━━━ꔹ
❰ .عبارات ❱
♚ يجيبلك عبارات مقتبسة
ꔹ━━━━━ꔹ
❰ .صداقه ❱
♚ البوت يمنشن لاتنين يبقو اصدقاء
ꔹ━━━━━ꔹ
❰ .زواج ❱
♚ البوت يمنشن لاتنين يتجوزوا 
ꔹ━━━━━ꔹ
❰ .طلاق ❱
♚ البوت يطلق اتنين
ꔹ━━━━━ꔹ
❰ .@الحب ❱
♚ يقيس مدي الناس لك
ꔹ━━━━━ꔹ
❰ .شادو ❱
♚ اسال البوت اسئلة شخصية 
ꔹ━━━━━ꔹ
❰ .حجر ❱
♚ لعبة حجر ورقة مقص مع البوت 
ꔹ━━━━━ꔹ
❰ .شخصيه ❱
♚ البوت يجيب شخصية شخص
ꔹ━━━━━ꔹ
❰ .اجابه ❱
♚ البوت يحل رياضيات - حساب
ꔹ━━━━━ꔹ
❰ .الدون ❱
♚ يجيبلك صور رونالدو
ꔹ━━━━━ꔹ
❰ .ميسي ❱
♚ ييجيبلك صور ميسي
ꔹ━━━━━ꔹ
❰ .بنت ❱
♚ البوت يجيب صور بنات انمي
ꔹ━━━━━ꔹ
❰ .عيد ❱
♚ البوت يجيب صور اعياد ميلاد 
ꔹ━━━━━ꔹ
❰ .قطط ❱
♚ البوت يجيب صور قطط
ꔹ━━━━━ꔹ
❰ .نيكو ❱
♚ صور اشباه البشر ف الانمي
ꔹ━━━━━ꔹ
❰ .الكيوت ❱
♚ صور بنات من الانمي 
ꔹ━━━━━ꔹ
❰ .ميمز ❱
♚ ميمز انجليزيه
ꔹ━━━━━ꔹ
❰ .ميمز2 ❱
♚ ميمز انجليزيه
ꔹ━━━━━ꔹ
❰ .زغرفه ❱
♚ البوت يزخرف الكلمات
ꔹ━━━━━ꔹ
❰ .سؤال ❱
♚ يجيب لك اسئله انمي
ꔹ━━━━━ꔹ
❰ .توب ❱
♚ يجيبلك افضل عشر اشخاص
ꔹ━━━━━ꔹ
❰ .اختفاء ❱
♚ اترك سبب ذهابك

𓍹——————————𓍻
↝اليك قائمة باوامر البنك↜
𓍹——————————𓍻
❰ .البنك ❱
♚ يجيبلك حسابك البنكي
ꔹ━━━━━ꔹ
❰ .اسبوعي ❱
♚ مكافأة اسبوعية
ꔹ━━━━━ꔹ
❰ .يومي ❱
♚ مكافأة يومية
ꔹ━━━━━ꔹ
❰ .هديه ❱
♚ تعطي شخص هديه من عملات شادو
ꔹ━━━━━ꔹ
❰ .هجوم ❱
♚ سرقه رصيد شخص من البنك
ꔹ━━━━━ꔹ
❰ .عمل ❱
♚ البوت يقولك مهنه للحصول علي نقاط خبره
ꔹ━━━━━ꔹ
❰ .ماس ❱
♚ تحويل جواهر لشخص
ꔹ━━━━━ꔹ
❰ .كوين ❱
♚ تحويل كوينات لشخص
ꔹ━━━━━ꔹ
❰ .خبره ❱
♚ تحويل نقاط خبره لشخص
ꔹ━━━━━ꔹ
❰ .عملات ❱
♚ تحويل عملات لشخص

𓍹——————————𓍻
↝اليك قائمة باوامر القرآن↜
𓍹——————————𓍻
❰ .قران ❱
♚ يجيبلك فديوهات قران
ꔹ━━━━━ꔹ
❰ .اذكار الصباح ❱
♚ يجيبلك اذكار الصباح
ꔹ━━━━━ꔹ
❰ .اذكار المساء ❱
♚ يجيبلك اذكار المساء
ꔹ━━━━━ꔹ
❰ .الكرسي ❱
♚ ايه الكرسي
ꔹ━━━━━ꔹ
❰ .آيه ❱
♚ يرسل لك قرآن صوت وسورة
ꔹ━━━━━ꔹ
❰ .اذكار ❱
♚ البوت يجيب اذكار
 `.trim()

const im = ['']

try {
await conn.sendMessage(m.chat, { video: { url: im.getRandom() }, gifPlayback: true, caption: menu, mentions: [m.sender] }, { quoted: fkontak }) 
} catch (error) {
try {
await conn.sendMessage(m.chat, { image: { url: gataMenu.getRandom() }, gifPlayback: false, caption: menu, mentions: [m.sender] }, { quoted: fkontak }) 
} catch (error) {
try {
await conn.sendMessage(m.chat, { image: gataImg.getRandom(), gifPlayback: false, caption: menu, mentions: [m.sender] }, { quoted: fkontak }) 
} catch (error) {
try{
await conn.sendFile(m.chat, imagen5, 'menu.jpg', menu, fkontak, false, { mentions: [m.sender] })
} catch (error) {
return 
}}}} 

} catch (e) {
await m.reply(lenguajeGB['smsMalError3']() + '\n*' + lenguajeGB.smsMensError1() + '*\n*' + usedPrefix + `${lenguajeGB.lenguaje() == 'es' ? 'reporte' : 'report'}` + '* ' + `${lenguajeGB.smsMensError2()} ` + usedPrefix + command)
console.log(`❗❗ ${lenguajeGB['smsMensError2']()} ${usedPrefix + command} ❗❗`)
console.log(e)}}

handler.command = /^(م10|منيو10|المنيو10)$/i
export default handler

function clockString(ms) {
let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}
